# DataFrame-Pandas

In [1]:
#DataFrame-with DataFrame we can create two dimenton table with row and column
import numpy as np
import pandas as pa

In [7]:
#creating DataFrame using List
lst=["Asha",'Versha','baby','Azula']
df=pa.DataFrame(data=lst)#it's automatically generated row and column as 0,1...
df

        0
0    Asha
1  Versha
2    baby
3   Azula

In [8]:
#in DataFrame,if we use print() ,it give output as normal but directly if we print,it's give colorfull output
print(df)

        0
0    Asha
1  Versha
2    baby
3   Azula

In [13]:
#how to set row and column names as we wamt into the DataFrame
lst2=["Asha",'Versha','baby','Azula'],['mani','raju','Raj','Muthu']
print(lst2)
print('*'*50)
df1=pa.DataFrame(lst2,index=['Girls','Boys'],columns=['A','B','C','D'])#index-row heading,columns-Column headings
print(df1)

(['Asha', 'Versha', 'baby', 'Azula'], ['mani', 'raju', 'Raj', 'Muthu'])
**************************************************
          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu

In [15]:
#creating a dictionary containing employee data into dataframe
data={'NAME':['Karthik','Bharat','Vasu','Mani'],
     'AGE':[23,45,56,24],
      'ADDRESS':['TCR','Chennai','Coimbatore','Madurai'],
      'QUALIFICATION':['BSC(CS)','BTEC','MTEC','Bcom']
     }
print(data)
print('*'*50)
df2=pa.DataFrame(data)#it's take dictionary key values as Column heders
df2

{'NAME': ['Karthik', 'Bharat', 'Vasu', 'Mani'], 'AGE': [23, 45, 56, 24], 'ADDRESS': ['TCR', 'Chennai', 'Coimbatore', 'Madurai'], 'QUALIFICATION': ['BSC(CS)', 'BTEC', 'MTEC', 'Bcom']}
**************************************************

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [16]:
print(df2)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [18]:
#how to fetch index(row) values and columns values
print(df2.index)
print(df1.index)
print(df2.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['Girls', 'Boys'], dtype='object')
Index(['NAME', 'AGE', 'ADDRESS', 'QUALIFICATION'], dtype='object')

In [23]:
#selecting a column
print(df2)
print('*'*50)
print(df2['NAME'])#mentioned column datas
print(df2[['NAME']])#mentioned column datas with column header

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
0    Karthik
1     Bharat
2       Vasu
3       Mani
Name: NAME, dtype: object
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [25]:
#selecting a multiple columns
print(df2)
print('*'*50)
print(df2[['NAME','AGE']])#mentioned Name and age column datas and with column headers

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
      NAME  AGE
0  Karthik   23
1   Bharat   45
2     Vasu   56
3     Mani   24
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [45]:
#Access the Values from row DataFrame
#iloc-which is used to fetch we given specific row
print(df2)
print('*'*50)
#if i want fetch only Karthik row 
print(df2.iloc[0])
print('*'*50)
#if we want to fetch one value from dataframe,we can use below statment
print(df2['NAME'][0])

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
NAME             Karthik
AGE                   23
ADDRESS              TCR
QUALIFICATION    BSC(CS)
Name: 0, dtype: object
**************************************************
Karthik

In [48]:
#drop-it is used to delete one 
print(df2)
print('*'*50)
#if we want delete One column,use below code
df2.drop('AGE',axis=1)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [49]:
#if we want delete One row,use below code
df2.drop(0,axis=0)

     NAME  AGE     ADDRESS QUALIFICATION
1  Bharat   45     Chennai          BTEC
2    Vasu   56  Coimbatore          MTEC
3    Mani   24     Madurai          Bcom

In [50]:
df2#above we did drop changes not applied in real varible if we want to delete permently we can use inplace

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [51]:
df2.drop('AGE',axis=1,inplace=True)#Age column deleted Permently using inplace keyword

In [52]:
df2

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [51]:
#create DataFrame with NaN values
import pandas as pa
import numpy as np
nan_dataframe=pa.DataFrame([[10,np.nan,30],[40,50,np.nan],[60,70,80],[np.nan,np.nan,np.nan]])
nan_dataframe

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [56]:
#dropna-which is used to drop row or column which are contain NaN value and display unnan values
print(nan_dataframe.dropna())#defaultly it will deleted row wise
print('*'*50)
print(nan_dataframe.dropna(axis=0))#row
print('*'*50)
print(nan_dataframe.dropna(axis=1))#if we want delete column wise use axis=1
#if we want to permently delete non values in DataFrame ,use inplace=True

      0     1     2
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [72]:
#thresh-it will display non-nan valus rows or columns as we given value
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.dropna(thresh=2))#it's display which are the row has two non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=0))#it's display which are the row has three non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=1))#it's display which are the column has three non-Nan values
#use inplace=true to permenant cahnge

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
      0
0  10.0
1  40.0
2  60.0
3   NaN

In [80]:
#fillna-it is used to fill we given value to nan value posotion
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.fillna(value="karthik"))
print('*'*50)
print(nan_dataframe.fillna(value=20))
print('*'*50)
print(nan_dataframe.fillna(value=nan_dataframe.mean()))

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
         0        1        2
0     10.0  karthik     30.0
1     40.0     50.0  karthik
2     60.0     70.0     80.0
3  karthik  karthik  karthik
**************************************************
      0     1     2
0  10.0  20.0  30.0
1  40.0  50.0  20.0
2  60.0  70.0  80.0
3  20.0  20.0  20.0
**************************************************
           0     1     2
0  10.000000  60.0  30.0
1  40.000000  50.0  55.0
2  60.000000  70.0  80.0
3  36.666667  60.0  55.0

In [94]:
#ffill-forward fill-it's fill forward value to the NaN Value
#bfill-backward fill-it is used to fill backward value to the Nan value
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.fillna(method="ffill"))
print(nan_dataframe.fillna(method="bfill"))

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0  30.0
2  60.0  70.0  80.0
3  60.0  70.0  80.0
      0     1     2
0  10.0  50.0  30.0
1  40.0  50.0  80.0
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [84]:
#concat-it is used to concat two dataFrames or more than two dataframes
print(df1)
print('*'*50)
print(df2)
print('*'*50)
print(pa.concat([df1,df2]))

          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu
**************************************************
      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom
**************************************************
          A       B     C      D     NAME     ADDRESS QUALIFICATION
Girls  Asha  Versha  baby  Azula      NaN         NaN           NaN
Boys   mani    raju   Raj  Muthu      NaN         NaN           NaN
0       NaN     NaN   NaN    NaN  Karthik         TCR       BSC(CS)
1       NaN     NaN   NaN    NaN   Bharat     Chennai          BTEC
2       NaN     NaN   NaN    NaN     Vasu  Coimbatore          MTEC
3       NaN     NaN   NaN    NaN     Mani     Madurai          Bcom

In [89]:
#crating data frame using concat two series
from pandas import DataFrame,Series
ser1=Series(np.arange(3),index=['A','B','C'])
print(ser1)
print('*'*50)
ser2=Series(np.arange(11,13),index=['X','Y'])
print(ser2)
print('*'*50)
print(pa.concat([ser1,ser2],axis=1,sort=False))#it's concatinated like column it's added first series as first column.second
                                              #series as a second column
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,sort=True))#it's concatinated like a rowise
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,keys=['Tab1','Tab2']))

A    0
B    1
C    2
dtype: int32
**************************************************
X    11
Y    12
dtype: int32
**************************************************
     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0
**************************************************
A     0
B     1
C     2
X    11
Y    12
dtype: int32
**************************************************
Tab1  A     0
      B     1
      C     2
Tab2  X    11
      Y    12
dtype: int32

In [1]:
#how to change DataFrame into Csv file
import numpy as np
import pandas as pd

In [3]:
data={'Name':['Karthik','Raja','Mani','Muthu'],
     'Age':[23,24,25,26],
     'Role':['Developer','TestEngineer','IAS','IPS'],
     'Degree':['MCA','BSC','Btech','Mtech']}
d=pd.DataFrame(data)
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [5]:
d.to_csv('details.csv')#it's going to save working currently location into c:(C:\Users\Admin\PYTHON\Pandas_Practise_files)
d.to_csv('E:/Python_notes/Details.csv')#here it will store to mentiond E:path as a Csv file

In [8]:
#if we want to save data in to Excel file use below code
d.to_excel('details2.xlsx')#it's going to save working currently location into c:(C:\Users\Admin\PYTHON\Pandas_Practise_files)
d.to_excel('E:/Python_notes/details2.xlsx')#here it will store to mentiond E:path as a excel file

In [12]:
#while saving data's to file,if we not need index means, use below one
d.to_html('details3.html',index=False)#using to_html we can change data's into html file format

In [ ]:
#if we want to save data as a Text file use below code
d.to_csv('details3.txt')

In [18]:
#how to find Who are all have more than age 23
d1=d[d['Age']>23]
d1

    Name  Age          Role Degree
1   Raja   24  TestEngineer    BSC
2   Mani   25           IAS  Btech
3  Muthu   26           IPS  Mtech

In [19]:
#if we want count of who are all have more than 23 means,use below code
d1.count()

Name      3
Age       3
Role      3
Degree    3
dtype: int64

In [20]:
#how to sort whole dataframe by one column or more than one column values
#ascending order
d2=d.sort_values(by='Age')#by is which column we need to sort
d2

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [21]:
#decending order
d2=d.sort_values(by='Age',ascending=False)#by is which column we need to sort,if we give ascending=False,perform decending order
d2

      Name  Age          Role Degree
3    Muthu   26           IPS  Mtech
2     Mani   25           IAS  Btech
1     Raja   24  TestEngineer    BSC
0  Karthik   23     Developer    MCA

In [26]:
#if we want sort whole dataFrame by two columns
d2=d.sort_values(by=['Role','Age'],ascending=False)#but here Age not sorted as we expected cause Role 
d2

      Name  Age          Role Degree
1     Raja   24  TestEngineer    BSC
3    Muthu   26           IPS  Mtech
2     Mani   25           IAS  Btech
0  Karthik   23     Developer    MCA

In [28]:
#if we want to sort one column values insted of whole Dataframe
d3=np.sort(d['Age'])
d3

array([23, 24, 25, 26], dtype=int64)

In [31]:
#how to fetch data who's age more than 25 and completed MCA
data1={'Name':['Karthik','Raja','Mani','Muthu','Raj','Rose'],
     'Age':[27,24,25,26,29,56],
     'Role':['Developer','TestEngineer','IAS','IPS','Engineer','Doctor'],
     'Degree':['MCA','BSC','Btech','Mtech','MCA','MBBS']}
dd=pd.DataFrame(data1)
dd

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [34]:
#how to fetch data who's age more than 25 and completed MCA
dd[(dd['Age']>25) & (dd['Degree']=='MCA')]#here we using & combing two logical conditions instead of 'and'
#if we use |(or) means,both condition will work

      Name  Age       Role Degree
0  Karthik   27  Developer    MCA
4      Raj   29   Engineer    MCA

In [47]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [46]:
#how to find lowest and Higesest value of Specfic column
min1=d['Age'].min()
max1=d['Age'].max()
print(min1)
max1

23

26

In [45]:
#how to find index position of min value
d['Age'].tolist().index(min1)#here it's changing Age column values to list then finding index value of min1=23

0

In [74]:
#how to replace Column value
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [75]:
#how to replace Column value
d['Name'].replace('Mani',"Baby",inplace=True)

In [76]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Baby   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [77]:
#if we want to replace two values from same colum,use below code
d['Name'].replace(['Muthu','Raja'],["Aasha",'Versha'],inplace=True)

In [78]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1   Versha   24  TestEngineer    BSC
2     Baby   25           IAS  Btech
3    Aasha   26           IPS  Mtech

In [ ]:
#with replace also we can use bfill and ffill

In [52]:
#how to find
nan_dataframe

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [53]:
#it's help to drop the row which contain NaN value
nan_dataframe.dropna(axis=0)

      0     1     2
2  60.0  70.0  80.0

In [54]:
#it's help to drop the column which contain NaN value
nan_dataframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [55]:
#it check whether values are Nan or not(Nan means=True,non-nan=False)
nan_dataframe.isnull()
#we can use nan_dataframe.isna() also instaed of isnull()

       0      1      2
0  False   True  False
1  False  False   True
2  False  False  False
3   True   True   True

In [80]:
#it check whether values are Non-NaN or not(not-Nan means=True,nan=False)
nan_dataframe.notna()

       0      1      2
0   True  False   True
1   True   True  False
2   True   True   True
3  False  False  False

In [57]:
#it helps to drop column which has NaN value
#how='any'-if column has any one NaN value,it drop that column
nan_dataframe.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [58]:
#it helps to drop row which has NaN value
#how='any'-if row has any one NaN value,it drop that row
nan_dataframe.dropna(how='any',axis=0)

      0     1     2
2  60.0  70.0  80.0

In [59]:
#it helps to drop row which has NaN value
#how='all'-if row has all NaN value,it drop that row
nan_dataframe.dropna(how='all',axis=0)

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0

In [60]:
#it helps to drop column which has NaN value
#how='all'-if column has all NaN value,it drop that column
nan_dataframe.dropna(how='all',axis=1)

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [92]:
#if we want to fetch anyone  nan values rows,use below code
nan_dataframe[nan_dataframe.isna().any(axis=1)]#it's checking row only
#any()-any one row element is Nan,it will give True

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
3   NaN   NaN   NaN

In [93]:
#if we want to fetch all nan values rows,use below code
nan_dataframe[nan_dataframe.isna().all(axis=1)]#it's checking row only
#all()- all row element is Nan,it will give True

    0   1   2
3 NaN NaN NaN